[
	{
		"id": "scalability",
		"title": "Масштабируемость",
		"description": "В электронике и информатике означает способность системы, сети или процесса справляться с увеличением рабочей нагрузки (увеличивать свою производительность) при добавлении ресурсов (обычно аппаратных). Масштабируемость — важный аспект электронных систем, программных комплексов, систем баз данных, маршрутизаторов, сетей и т. п., если для них требуется возможность работать под большой нагрузкой. Система называется масштабируемой, если она способна увеличивать производительность пропорционально дополнительным ресурсам. Масштабируемость можно оценить через отношение прироста производительности системы к приросту используемых ресурсов. Чем ближе это отношение к единице, тем лучше. Также под масштабируемостью понимается возможность наращивания дополнительных ресурсов без структурных изменений центрального узла системы.",
		"english": "scalability",
		"reference": "Масштабируемость | это... Что такое Масштабируемость? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/96988 (дата обращения: 03.10.2022)."
	},
	{
		"id": "cache",
		"title": "Кэш",
		"description": "Компьютерная область памяти, которая служит для буфера обмена, как правило имеет большую скорость, чем основная память.",
		"english": "cache",
		"reference": "Захаренко Е. Н., Комарова Л. Н., Нечаева И.В. Новый словарь иностранных слов: свыше 25 000 слов и словосочетаний. — М.: ООО ИФ «Азбуковник», 2008. — 1040 с. — 3-е изд., испр. и доп. ISBN 978-5-903021-08-6."
	},
	{
		"id": "microservice",
		"title": "Микросервисная архитектура",
		"description": "Распространенный подход к разработке программного обеспечения, когда приложение разбивается на небольшие автономные компоненты (микросервисы) с четко определенными интерфейсами. Именно эта архитектура характерна для cloud-native приложений, которые сейчас популярны благодаря преимуществам, что открывают для бизнеса облачные среды.",
		"reference": "Что такое микросервисная архитектура: простое объяснение | Блог VK Cloud // Mail.ru [Электронный ресурс]. URL: https://mcs.mail.ru/blog/prostym-jazykom-o-mikroservisnoj-arhitekture (дата обращения: 03.10.2022)."
	},
	{
		"id": "monolith",
		"title": "Монолитная архитектура",
		"description": "это традиционная модель программного обеспечения, которая представляет собой единый модуль, работающий автономно и независимо от других приложений. Монолитом часто называют нечто большое и неповоротливое, и эти два слова хорошо описывают монолитную архитектуру для проектирования ПО. Монолитная архитектура — это отдельная большая вычислительная сеть с единой базой кода, в которой объединены все бизнес-задачи. Чтобы внести изменения в такое приложение, необходимо обновить весь стек через базу кода, а также создать и развернуть обновленную версию интерфейса, находящегося на стороне службы. Это ограничивает работу с обновлениями и требует много времени.",
		"reference": "Atlassian Сравнение микросервисной и монолитной архитектур | Atlassian // Atlassian [Электронный ресурс]. URL: https://www.atlassian.com/ru/microservices/microservices-architecture/microservices-vs-monolith. (дата обращения: 03.10.2022)."
	},
	{
		"id": "web-server",
		"title": "Веб-сервер",
		"reference": "ВЕБ-СЕРВЕР | это... Что такое ВЕБ-СЕРВЕР? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/business/17500 (дата обращения: 03.10.2022).",
		"english": "web server",
		"description": "Это сервер, принимающий HTTP-запросы от клиентов, обычно веб-браузеров, и выдающий им HTTP-ответы, обычно вместе с HTML-страницей, изображением, файлом, медиа-потоком или другими данными. Веб-серверы — основа Всемирной паутины. Веб-сервером называют как программное обеспечение, выполняющее функции веб-сервера, так и компьютер, на котором это программное обеспечение работает. Клиенты получают доступ к веб-серверу по URL адресу нужной им веб-страницы или другого ресурса."
	},
	{
		"id": "cdn",
		"title": "CDN",
		"description": "Это географически распределённая сетевая инфраструктура, обеспечивающая быструю доставку контента пользователям веб-сервисов и сайтов. Входящие в состав CDN cерверы географически располагаются таким образом, чтобы сделать время ответа для пользователей сайта/сервиса минимальным.",
		"english": "Content Delivery Network",
		"reference": "Камилла Что такое CDN и как это работает? // Хабр [Электронный ресурс]. URL: https://habr.com/ru/company/selectel/blog/463915/ (дата обращения: 03.10.2022)."
	},
	{
		"id": "dynamic-content",
		"title": "Динамический контент",
		"description": "Контент, генерируемый на сервере в момент получения запроса (либо изменяемый пользователем, либо загружаемый из базы данных).",
		"reference": "Камилла Что такое CDN и как это работает? // Хабр [Электронный ресурс]. URL: https://habr.com/ru/company/selectel/blog/463915/ (дата обращения: 03.10.2022)."
	},
	{
		"id": "static-content",
		"title": "Статический контент",
		"description": "Контент, хранимый на сервере в неизменяемом виде (например, бинарные файлы, аудио- и видеофайлы, JS и CSS).",
		"reference": "Камилла Что такое CDN и как это работает? // Хабр [Электронный ресурс]. URL: https://habr.com/ru/company/selectel/blog/463915/ (дата обращения: 03.10.2022)."
	},
	{
		"id": "cap-theorem",
		"title": "CAP теорема",
		"description": "CAP-теорема — утверждение о том, что в распределённых системах нельзя одновременно добиться трёх свойств: Consistency — на всех не отказавших узлах одинаковые (с точки зрения пользователя) данные; Availability — запросы ко всем не отказавшим узлам возвращают ответ; Partition tolerance — даже если связь в системе стала нестабильной (вплоть до разделения системы на куски), но узлы работают, то система в целом продолжает работать",
		"reference": "1. CAP теорема — Викиконспекты // Ifmo.ru [Электронный ресурс]. URL: https://neerc.ifmo.ru/wiki/index.php?title=CAP_теорема (дата обращения: 03.10.2022)."
	},
	{
		"id": "distributed-systems",
		"title": "Распределенные системы",
		"description": "Распределенная система — это набор компьютерных программ, использующих вычислительные ресурсы нескольких отдельных вычислительных узлов для достижения одной общей цели. Ее также называют распределенными вычислениями или распределенной базой данных. Распределенная система основывается на отдельных узлах, которые обмениваются данными и выполняют синхронизацию в общей сети. Обычно узлы представляют собой отдельные физические аппаратные устройства, но это могут быть и отдельные программные процессы или другие рекурсивные инкапсулированные системы. Распределенные системы направлены на устранение узких мест или единых точек отказа в системе.",
		"reference": "Atlassian Что такое распределенная система? | Atlassian // Atlassian [Электронный ресурс]. URL: https://www.atlassian.com/ru/microservices/microservices-architecture/distributed-architecture. (дата обращения: 03.10.2022)."
	},
	{
		"id": "replication",
		"title": "Репликация",
		"description": "Это поддержание одинаковых данных на нескольких узлах распределенной системы.",
		"english": "replication",
		"reference": "Репликация — Викиконспекты // Ifmo.ru [Электронный ресурс]. URL: http://neerc.ifmo.ru/wiki/index.php?title=Репликация (дата обращения: 03.10.2022)."
	},
	{
		"id": "horizontal-scaling",
		"title": "Горизонтальное масштабирование",
		"description": "техника, которая позволяет решить две задачи: выдержать большую нагрузку и повысить отказоустойчивость системы. Она используется как для нагруженных так и не нагруженных сайтов, которым важно оставаться работоспособными в случае отказа сервера. А сервера имеют свойство ломаться.",
		"reference": "Горизонтальное масштабирование // Хекслет [Электронный ресурс]. URL: https://ru.hexlet.io/courses/production-basics/lessons/horizontal-scaling/theory_unit (дата обращения: 03.10.2022)."
	},
	{
		"id": "vertical-scaling",
		"title": "Вертикальное масштабирование",
		"description": "Повышение производительности обработки данных за счет улучшения характеристик процессоров, памяти, хранения или коннективности.",
		"reference": "CDTOwiki Вертикальное масштабирование – термин // CDTOwiki [Электронный ресурс]. URL: https://cdto.wiki/Вертикальное_масштабирование (дата обращения: 03.10.2022)."
	},
	{
		"id": "serverless-computing",
		"title": "Бессерверные вычисленения",
		"english": "serveless computing",
		"description": "Стратегия организации платформенных облачных услуг, при которой облако автоматически и динамически управляет выделением вычислительных ресурсов в зависимости от пользовательской нагрузки. Основная задача такой стратегии — реализация шаблона «функция как услуга», при котором для выполнения каждого запроса (вызова функции) создаётся отдельный контейнер или виртуальная машина, уничтожающиеся после выполнения.",
		"reference": "Haines S. Serverless computing with AWS Lambda, Part 1 // InfoWorld [Электронный ресурс]. URL: https://www.infoworld.com/article/3210726/serverless-computing-with-aws-lambda.html (дата обращения: 03.10.2022)."
	},
	{
		"id": "devops",
		"title": "DevOps",
		"description": "Это сочетание культурных принципов, подходов и средств, которое улучшает способность компаний создавать приложения и сервисы на высокой скорости. С DevOps разработка и оптимизация продуктов происходит быстрее, чем при использовании традиционных процессов работы над программным обеспечением и управления инфраструктурой. Благодаря такой скорости компании могут повысить уровень обслуживания клиентов и более эффективно конкурировать на рынке.",
		"reference": "Что такое DevOps? – Amazon Web Services (AWS) // Amazon Web Services, Inc. [Электронный ресурс]. URL: https://aws.amazon.com/ru/devops/what-is-devops/ (дата обращения: 03.10.2022).",
		"english": "Development Operations"
	},
	{
		"id": "load-balancing",
		"title": "Балансировка нагрузки",
		"description": "Это метод, который гарантирует, что сервер организации не будет перегружен трафиком. Под этим определением понимается эффективное распределение входящего сетевого трафика между группой внутренних серверов, также известной как ферма серверов или пул серверов.",
		"reference": "ООО \"Облачные технологии\" Балансировка нагрузки серверов - алгоритмы, методы, преимущества // Балансировка нагрузки [Электронный ресурс]. URL: https://sbercloud.ru/ru/warp/balansirovka-nagruzki (дата обращения: 03.10.2022)."
	},
	{
		"id": "cluster",
		"title": "Кластер",
		"description": "Группа компьютеров, объединённых высокоскоростными каналами связи и представляющая с точки зрения пользователя единый аппаратный ресурс; также — группа серверов, объединённых логически, способных обрабатывать идентичные запросы и использующихся как единый ресурс.",
		"reference": "Кластер | это... Что такое Кластер? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/36261 (дата обращения: 03.10.2022)."
	},
	{
		"id": "distributed-tracing",
		"title": "Распределенная трассировка",
		"description": "Распределенная трассировка, также называемая распределенной трассировкой запросов, представляет собой метод, используемый для профилирования и мониторинга приложений, особенно тех, которые построены с использованием архитектуры микросервисов. Распределенная трассировка помогает точно определить, где происходят сбои и что приводит к снижению производительности программного обеспечения",
		"reference": "Кива В. С., Брановицкий А. А. РАСПРЕДЕЛЕННАЯ ТРАССИРОВКА. Информационные технологии и системы 2019"
	},
	{
		"id": "system-architecture",
		"title": "Системная архитектура",
		"description": "Фундаментальная организация системы, реализованная в ее компонентах, связях этих компонентов друг с другом и внешней средой и принципах, определяющих структуру и развитие системы.",
		"reference": "Системная архитектура | это... Что такое Системная архитектура? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/682878 (дата обращения: 03.10.2022)."
	},
	{
		"id": "database",
		"title": "База данных",
		"description": "Это упорядоченный набор структурированной информации или данных, которые обычно хранятся в электронном виде в компьютерной системе",
		"reference": "Что такое база данных? // Oracle.com [Электронный ресурс]. URL: https://www.oracle.com/cis/database/what-is-database/ (дата обращения: 03.10.2022)."
	},
	{
		"id": "dbms",
		"title": "СУБД",
		"description": "СУБД служит интерфейсом между базой данных и пользователями или программами, предоставляя пользователям возможность получать и обновлять информацию, а также управлять ее упорядочением и оптимизацией. СУБД обеспечивает контроль и управление данными, позволяя выполнять различные административные операции, такие как мониторинг производительности, настройка, а также резервное копирование и восстановление.",
		"reference": "Что такое база данных? // Oracle.com [Электронный ресурс]. URL: https://www.oracle.com/cis/database/what-is-database/ (дата обращения: 03.10.2022)."
	},
	{
		"id": "atomacity",
		"title": "Атомарность",
		"description": "Атомарность гарантирует, что никакая транзакция не будет зафиксирована в системе частично. Будут либо выполнены все её подоперации, либо не выполнено ни одной. Поскольку на практике невозможно одновременно и атомарно выполнить всю последовательность операций внутри транзакции, вводится понятие «отката» (rollback): если транзакцию не удаётся полностью завершить, результаты всех её до сих пор произведённых действий будут отменены и система вернётся в исходное состояние.",
		"reference": "ACID | это... Что такое ACID? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/15665 (дата обращения: 03.10.2022)."
	},
	{
		"id": "consistency",
		"title": "Согласованность",
		"description": "Одно из самых сложных и неоднозначных свойств из четвёрки ACID. В соответствии с этим требованием, система находится в согласованном состоянии до начала транзакции и должна остаться в согласованном состоянии после завершения транзакции. Не нужно путать требование согласованности с требованиями целостности (integrity). Последние правила являются более узкими и, во многом, специфичны для реляционных СУБД: есть требования целостности типов (domain integrity), целостности ссылок (referential integrity), целостности сущностей (entity integrity), которые не могут быть нарушены физически в силу особенностей реализации системы.",
		"reference": "ACID | это... Что такое ACID? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/15665 (дата обращения: 03.10.2022)."
	},
	{
		"id": "isolation",
		"title": "Изолированность",
		"description": "Во время выполнения транзакции параллельные транзакции не должны оказывать влияние на её результат. Это свойство не соблюдается на уровне изолированности Read Committed и ниже.",
		"reference": "ACID | это... Что такое ACID? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/15665 (дата обращения: 03.10.2022)."
	},
	{
		"id": "durability",
		"title": "Надежность",
		"description": "Независимо от проблем на нижних уровнях (к примеру, обесточивание системы или сбои в оборудовании) изменения, сделанные успешно завершённой транзакцией, должны остаться сохранёнными после возвращения системы в работу. Другими словами, если пользователь получил подтверждение от системы, что транзакция выполнена, он может быть уверен, что сделанные им изменения не будут отменены из-за какого-либо сбоя.",
		"reference": "ACID | это... Что такое ACID? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/15665 (дата обращения: 03.10.2022)."
	},
	{
		"id": "acid",
		"title": "ACID требования",
		"description": "В информатике акроним ACID описывает требования к транзакционной системе (например, к СУБД), обеспечивающие наиболее надёжную и предсказуемую её работу. Требования ACID были в основном сформулированы в конце 70-х годов Джимом Греем.",
		"reference": "ACID | это... Что такое ACID? // Словари и энциклопедии на Академике [Электронный ресурс]. URL: https://dic.academic.ru/dic.nsf/ruwiki/15665 (дата обращения: 03.10.2022)."
	}
]
